# Observations:

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file)

In [2]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
purchase_data["Purchase ID"].count()

780

In [5]:
# Player Count
unique = purchase_data["SN"].unique()

In [6]:
total_players = len(purchase_data["SN"].unique())

In [7]:
total_players

576

In [8]:
sum_table = pd.DataFrame({"Total Players":[total_players]})
sum_table

   Total Players
0            576

In [9]:
# Purchasing Analysis
average_price = purchase_data["Price"].mean()
average_price

3.050987179487176

In [11]:
no_of_purchases = len(purchase_data["Purchase ID"].unique())
no_of_purchases

780

In [13]:
total_revenue = purchase_data["Price"].sum()
total_revenue

2379.77

In [14]:
unique_items = purchase_data["Item ID"].unique()

In [15]:
unique_items

array([108, 143,  92, 100, 131,  81, 169, 162,  21, 136,  95, 116,   4,
       165,  98,  40, 161,  82,  89,  57, 168,  24, 151, 141, 178,  71,
        96, 119,  37, 140, 179, 133,  44, 160,  53,  76,  73, 172,   7,
        72,   9, 181, 102, 170, 138, 110,  22,  15,  60, 176,  25,  84,
        80, 152, 105, 125,  56,  34,   6,  27,  29,  68, 124,  88,  20,
        50, 174,  12,  33, 129,  17,  59,  39, 164, 134, 101, 109,  10,
        54,  99,  85, 139,  41, 150,  13, 117,  78,  87,   1,  62,  75,
        58,  74, 120, 145,   0,   2, 146, 158,   8, 175,  46, 148, 111,
         3,  65, 183,  30, 157, 123,   5, 144, 103, 135,  51, 154,  32,
        77,  11,  63,  69, 113, 153, 114, 149, 159, 137, 142,  66,  97,
       163, 107,  16,  42,  19,  83,  23,  28,  94, 182,  70,  18, 166,
       173, 167, 155, 128, 156, 147,  35, 171,  52, 106,  38,  91, 118,
        67,  45,  49, 121,  79,  14,  43,  31,  64,  86,  93,  26, 122,
        61,  48, 112, 126, 115,  55, 132, 127,  47, 130,  90, 177, 104,
       180], dtype=int64)

In [16]:
no_of_items = len(unique_items)
no_of_items

183

In [17]:
# Place all of the data found into a summary DataFrame
summary_table = pd.DataFrame({"No of Unique Items":[no_of_items],
                              "Average Price": [average_price],
                              "Number of Purchases": [no_of_purchases],
                              "Total Revenue": [total_revenue]})

In [18]:
summary_table

   No of Unique Items  Average Price  Number of Purchases  Total Revenue
0                 183       3.050987                  780        2379.77

In [19]:
summary_table["Average Price"] = summary_table["Average Price"].map("${:,.2f}".format)
summary_table

   No of Unique Items Average Price  Number of Purchases  Total Revenue
0                 183         $3.05                  780        2379.77

In [20]:
summary_table["Total Revenue"] = summary_table["Total Revenue"].map("${:,.2f}".format)
summary_table

   No of Unique Items Average Price  Number of Purchases Total Revenue
0                 183         $3.05                  780     $2,379.77

In [21]:
purchase_data.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

In [77]:
group_gender = purchase_data.groupby(["Gender"])
unique_gender = group_gender["SN"].nunique()
unique_gender

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [78]:
#percent = round((purchase_data["Gender"].value_counts()/purchase_data["Gender"].count())*100,2)
percent = round(unique_gender/sum(unique_gender) *100,2)
percent

Gender
Female                   14.06
Male                     84.03
Other / Non-Disclosed     1.91
Name: SN, dtype: float64

In [80]:
summary_gender_demographics = pd.DataFrame({"Total Count":unique_gender,
                              "Percentage of Players": percent})
summary_gender_demographics

                       Total Count  Percentage of Players
Gender
Female                          81                  14.06
Male                           484                  84.03
Other / Non-Disclosed           11                   1.91

In [99]:
purchase_count = group_gender["Item ID"].count()
purchase_count

avg_pprice = round(group_gender["Price"].mean(),2)
avg_pprice

t_purchase = group_gender["Price"].sum()
t_purchase

shoppers = group_gender["SN"].nunique()
shoppers

price_pp =round(t_purchase/ shoppers,2)
price_pp

purchasing_analysis = pd.DataFrame ({"Purchase Count" : purchase_count, "Average Purchase Price" : avg_pprice,
                                     "Total Purchase Value" : t_purchase, "Avg Total Purchase per Person" : price_pp})

purchasing_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

In [105]:
purchasing_analysis["Average Purchase Price"] = purchasing_analysis["Average Purchase Price"].map("${:,.2f}".format)
purchasing_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,4.47
Male,652,$3.02,"$1,967.64",4.07
Other / Non-Disclosed,15,$3.35,$50.19,4.56

In [107]:
purchasing_analysis["Avg Total Purchase per Person"] = purchasing_analysis["Avg Total Purchase per Person"].map("${:,.2f}".format)
purchasing_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [113]:
# Create the bins in which Data will be held
bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]

# Create the names for the four bins
group_names = ["<10", "10-14", "15-19", "20-24", "25-29","30-34","35-39","40+"]
purchase_data["group_names"] = pd.cut(purchase_data["Age"], bins, labels=group_names)
#purchase_data.head(3)

In [120]:
group_players = purchase_data.groupby(["group_names"])
group_players

count_players = group_players["SN"].nunique()
count_players

percent_players = round(count_players/sum(count_players)*100,2)
percent_players

group_names
<10       2.95
10-14     3.82
15-19    18.58
20-24    44.79
25-29    13.37
30-34     9.03
35-39     5.38
40+       2.08
Name: SN, dtype: float64

In [121]:
age_demographics = pd.DataFrame ({"Total Count" : count_players, "Percentage of Players" : percent_players})

age_demographics

             Total Count  Percentage of Players
group_names
<10                   17                   2.95
10-14                 22                   3.82
15-19                107                  18.58
20-24                258                  44.79
25-29                 77                  13.37
30-34                 52                   9.03
35-39                 31                   5.38
40+                   12                   2.08

In [114]:
group_gender2 = purchase_data.groupby(["group_names"])
group_gender2

purchase_count2 = group_gender2["Item ID"].count()
#purchase_count2

avg_pprice2 = round(group_gender2["Price"].mean(),2)
#avg_pprice

t_purchase2 = group_gender2["Price"].sum()
#t_purchase2

shoppers2 = group_gender2["SN"].nunique()
#shoppers

price_pp2=round(t_purchase2/ shoppers2,2)
#price_pp2

purchasing_analysis2 = pd.DataFrame ({"Purchase Count" : purchase_count2, "Average Purchase Price" : avg_pprice2,
                                     "Total Purchase Value" : t_purchase2, "Avg Total Purchase per Person" : price_pp2})

purchasing_analysis2

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
group_names,,,,
<10,23,3.35,77.13,4.54
10-14,28,2.96,82.78,3.76
15-19,136,3.04,412.89,3.86
20-24,365,3.05,1114.06,4.32
25-29,101,2.90,293.00,3.81
30-34,73,2.93,214.00,4.12
35-39,41,3.60,147.67,4.76
40+,13,2.94,38.24,3.19

In [131]:
#top spenders
SN_count = purchase_data.groupby(["SN"])

SN_pprice = SN_count["Price"].sum()

SN_purchase_count = SN_count["Item ID"].nunique()

SN_avg_pp = SN_count["Price"].mean()

df_SN =pd.DataFrame({"Purchase Count" : SN_purchase_count, "Average Purchase Price":SN_avg_pp ,
                     "Total Purchase Value": SN_pprice})
#df_SN

sorted_df1 = df_SN.sort_values("Total Purchase Value", ascending = False)

high_index = sorted_df1.reset_index(drop = False)

top_spenders = high_index.iloc[0:5,:]

top_spenders

            SN  Purchase Count  Average Purchase Price  Total Purchase Value
0    Lisosia93               5                3.792000                 18.96
1  Idastidru52               4                3.862500                 15.45
2   Chamjask73               3                4.610000                 13.83
3       Iral74               4                3.405000                 13.62
4  Iskadarya95               3                4.366667                 13.10

In [135]:
#Most popular items
pop_count = purchase_data.groupby(["Item ID","Item Name"])

pop_purchase_count = pop_count["Item ID"].count()

pop_pprice = pop_count["Price"].sum()

item_price = pop_count["Price"].mean()

df_popular_items =pd.DataFrame({"Purchase Count" : pop_purchase_count, "Item Price": item_price ,
                     "Total Purchase Value": pop_pprice})


sorted_df2 = df_popular_items.sort_values("Purchase Count", ascending = False)

high_index2 = sorted_df2.reset_index(drop = False)

most_popular = high_index2.iloc[0:5,:]

most_popular

,Item ID,Item Name,Purchase Count,Item Price,Total Purchase Value
0,178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
1,145,Fiery Glass Crusader,9,4.58,41.22
2,108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
3,82,Nirvana,9,4.90,44.10
4,19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

In [137]:
most_profitable = most_popular.sort_values("Total Purchase Value", ascending = False)

most_profitable

,Item ID,Item Name,Purchase Count,Item Price,Total Purchase Value
0,178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
3,82,Nirvana,9,4.90,44.10
1,145,Fiery Glass Crusader,9,4.58,41.22
2,108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
4,19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16